Week10/B_SimpleStaticMixer/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingBuoyantFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl   timeStep;
        writeInterval  1;
        probeLocations
        (
            (0.05 0.05 0.126)
            (0.05 0.05 0.176)
            (0.05 0.05 0.226)
            (0.05 0.05 0.276)
            (0.05 0.05 0.326)
            (0.05 0.05 0.376)
            (0.05 0.05 0.426)
            (0.05 0.05 0.476)
        );
        fixedLocations  false;
        fields
        (
            CO2
        );
    }
}


// ************************************************************************* //
